{
  "users": [
    {
      "id": "1",
      "username": "admin",
      "password": "admin123"
    },
    {
      "id": "2",
      "username": "testuser",
      "password": "testpass"
    }
  ],
  "reports": [
   
    {
      "id": "1677",
      "title": "A cry for my rights",
      "description": "My name is Grace Achieng’, widow of David Otieno, and mother to our only son, Kevin.\n\nWhen David died in a road accident, I didn’t just lose a husband — I lost everything. His brothers came days after the funeral, demanding our home, saying, “A woman doesn’t inherit in this family.”\n\nI had lived in that house with David for 11 years. We built a life there. But without a written will, they threw me out. One day I came back from the market, and the locks had been changed. Kevin’s books, our clothes — dumped outside like trash.\n\nI begged the chief. I sought legal help. Nothing came fast enough. Today, Kevin and I live in a tiny rented room, far from the only home he knew. He asks when we’re going back. I have no answer.\n\nThis isn’t just my story. It's the story of many widows in Kenya. Traditions are used to strip us of our dignity, even when the Constitution protects our rights.\n\nI am a mother. I am a widow. And I demand justice.\nLet no woman be left homeless for burying her husband. Let the law protect us — not just in writing, but in truth.\n\n\n\n\n\n\n\n\n\n\n",
      "videoURL": ""
    },
    {
      "id": "c89c",
      "title": "Air India Flight AI‑171 Crash (June 12, 2025)",
      "description": "On June 12, 2025, Air India Flight AI-171, a Boeing 787 Dreamliner headed from Ahmedabad to London, crashed moments after takeoff, killing 241 of the 242 people on board and at least 19 people on the ground. The crash caused devastation at the B.J. Medical College hostel, where the aircraft struck after losing control. Black boxes have been recovered, and early investigations point to possible engine failure or system malfunction. As families mourn, the nation watches with heavy hearts. We demand that the true cause of this tragedy be thoroughly investigated, and that those responsible for any negligence be held fully accountable.",
      "videoURL": "https://youtu.be/yhS7OYX1-JU"
    },
    {
      "id": "fead",
      "title": " A Childhood Stolen in Afghanistan",
      "description": "Forced into marriage at age 10, one Afghan woman lost two daughters due to neglect and abuse. After enduring domestic violence, she escaped to Kabul but continued suffering under the Taliban, eventually fleeing to Iran. Now 26, she works as a tailor and advocates for women’s rights—all while mourning her missing children",
      "videoURL": ""
    }
  ]
}